def my_func():
      print('продолжим')
      input('enter')
      slovo00=input('ГлОгОлИ, пОвЕдАю: \n:')
      slovo=list(slovo00)

      set(slovo)
      a=['0001','1','аз','алатырь','Основные смыслы: Мировая года, Священный Грааль, Азы, Начало, Величие///Руна Алатырь – отражение глубокой стабильности «я», когда на человека не влияют внешние и внутренние факторы. Достижение абсолютного покоя, в котором любое принятое решение станет единственно верным, изменит жизнь к лучшему. Алатыть – это Горюч-Камень, семя Земли, взятое Демиургом со дна древнего Океана и давшее плоды тверди','Руна АлатырьВ славянском рунном алфавите символизирует букву А Перевод и значение славянской руны: Алатырь – это Начало, точка преткновения, вокруг которой крутится Мир. Алатырь есть везде и нигде, он и легок и тяжел, он и мал и велик. Это чистая энергия, магия – это с чего начинается Все. Главные значения руны Алатырь в силе, знаниях, возможностях. Цикличности, стабильности, лечении, восстановлении, указании пути – открытия дорог и перспектив.В скандинавском футарке нет ни одной руны, полностью передающей значение Алатыря. Лишь в некоторой степени можно привести в сравнение руну Йера и Стан из нортумбрийского ряда рун.Алатырь – это Мировая гора, центр Мира. Именно вокруг Алатыря идет вечная борьба Чернобога и Белбога, сражения и схватки сил Хаоса и Порядка – сохранение закона равновесия. Алатырь, камень-основа – поднятая Богами со дна Окияна горстка земли и перенесенная на Буян-Остров в открытое море.Под Алатырем берут начало все реки Мира и начинаются все дороги. Магические алтари для обращения к Прави и преподношения Треб – это символическое изображение Алатырь-камня, служащего троном главным Богам']

      b=['0010', '2', 'буки', 'берегиня','Основные смыслы: мать-Макошь, Земля, Судьба, береза Руна Берегиня – одна из ипостасей Богини-Женщины, хранительницы междумирья, сторожащей дорогу между потусторонним миром и миром живых. Традиционно охраняет весь род славян, молодых матерей и рожениц от происков сущностей нижнего мира.Древнеславянские и арийские женщины часто наносили руну на личные обереги. Одновременно она не пускает любопытных живых в мир предков. Прообраз Бабы-Яги, охраняющей границу леса и села; Русалки, стерегущей переход от суши к воде и т. д;','Руна Берегиня В славянском рунном алфавите символизирует букву Б Перевод и значение славянской руны: Работа с водой и землей, получение силы в новом начинании, удачи, достатка, благополучия, решения всех вопросов семьи и окончание неприятностей, защита, справедливость и покровительство – это главные свойства и значения руны Берегиня. Славится она и усилением таких качеств, как женская красота, мудрость, хитрость, зрелость и плодородие.Берегиня –  материнское начало, в славянских ведах под этим именем подразумевалась Богиня Макошь. Потому руна Матери-Макоши Берегиня ведает и земным плодородием, позволяющим жить людям, и вообще человеческими судьбами. Так как у Макоши две ипостаси – дневная и ночная, то и эта славянская руна в перевернутом значении бывает не только символом жизни, но и смерти. Только частью своих значений она походит на скандинавскую руну Беркана, а также образом Фригги, Небесной матери и Хель, Подземной Матери. По традиции Мать-Макошь как дает жизнь душам на земле, так и отнимает ее по прошествии времени, ткет человеческие судьбы вместе с помощью Доли и Недоли.Берегиня – это руна судьбы, так как Макошь порой считают продолжением Велеса, как супругу, а также руной силы стихии земли – тяжелой, могучей и благодарной за заботу.']

      v=['0011', '3', 'веди', 'ветер','Основные смыслы: Велес, Ветер, сила, ведун, знания,Руна Ветер – образ божественного наслаждения битвой, ветра, уносящего прочь все суетное, ветра Битвы, где смерть – лишь один из этапов поединка. Она родственна Коням, которые определяли у славян ход битвы и уносили павших за грань жизни;','Руна ВетерВ славянском рунном алфавите символизирует букву В Перевод и значение славянской руны: изменчивость, разрушение, окончание, уничтожение, стихийное бедствие, навевание, развеивание, очищение, возможности, скорость – вот в чем таится сила Ветра. Главное – научиться управлять ею и использовать осторожно в своих целях, задав правильный вектор движения. Как правило, в работе ее используют в комбинации с другими рунами именно для уточнения положительной или отрицательной позиции, а также для работы с внутренним Я, совершенствованием и развитием, вызове стихий и использовании энергии воздуха. На уровне магии руна Ветер символизирует магический круг и силу в нем, создавая вихрь и придавая скорости. Эта руна символизирует силу, мудрость, богатство и знания Велеса. Визуально она напоминается сдвоенную Требу – руну воина Духа. Так же, как и Треба, Ветер символизирует странника на пути к камню-Алатырю, направляющемуся за результатом и Силой. На эмоциональном уровне Ветер – это ярость, вдохновение, непреодолимое желание и действие.т их реализации']

      g=['0100', '4', 'глаголи', 'крада ','Руна Крада В славянском рунном алфавите символизирует буквы Г и К Перевод и значение славянской руны: Крада – это жертвенный огонь, зажигающийся для Богов не только при сжигании усопших, но и при принесении треб, ритуалах и просьбы совета или помощи в трудных делах. Этот огонь сжигает, убирает все ненужное, мешающее, очищает и открывает путь. Самые главные значения Крады в работе: избавление, признание, стремление к цели, знание и жажда познать, благодарность и выбор.В скандинавском футарке эта руна более всего соответствует Квеорту. Такое же четкое действие – сильное и необратимое, такая же сила огня и воплощение Божественной силы и замысла. Огонь – это дар Богов людям, поэтому в некоторой степени значению славянской руны Крада соотвествуют скандинавские Кано и Гебо. Это руна действия, глагола – воплощения поставленной цели и намерений. В магии Крада очищает каналы, высвобождает желания и помогает их реализации.']
         
      d=['0101', '5', 'добро', 'даждьбог','Основные смыслы: Дар, Добро, плодородие, достаток, богатство   Руна Даждьбог – обозначение древнего ритуала оплодотворения Небом Земли, который проводился славяно-арийскими племенами для получения хорошего урожая. Соответствует Даждьбогу – славянскому богу земледелия, покровителю плодородия;','Руна Даждьбог В славянском рунном алфавите символизирует букву Д Перевод и значение славянской руны: это персональная руна Даждьбога, его олицетворение. В отличие от Белбога, абсолютного Добра, Даждьбог понимает и заботится о своих потомках. Это мудрый дедушка, который может, как научить, так и наказать для пользы Рода. Он оставляет богатое наследство и помогает его приумножать. Постоянство и уверенность в завтрашнем дне, удача и достаток, прибыль и приумножение заработанного, ежедневный труд и получение результатов – вот что такое Даждьбог.В скандинавском футарке наиболее близкое значение к этой славянской руне имеют Феу и Йера. Однако при конкретных вопросах ее значение может совпадать с Дагазом, Ингузом и Гебо. Вообще – Даждьбог – это дар Богов и Предков, это возникновение новых связей, друзей и возможностей. Защита на пути к тому, что сделает крепким и сильным весь Род, успешный конец начатого. Скандинавы знали Даджьбога под именем Фрейр, а культы называли его Дагдой – это клад всех возможных и желаемых благ, мудрые советы и зоркое око дедушки.']
         
      e=['0110', '6', 'есть', 'есть','Основные смыслы: Жизнь, движение, естественный ход событий','Руна Есть – изначальная Мать-Богиня, абсолютное воплощение женского начала у славян. Принадлежит Живе – хранительнице жизни,Руна Есть В славянском рунном алфавите символизирует букву Е Перевод и значение славянской руны: Есть – это данность, это жизнь и ее течение: силы сока земли текут по корням и питают деревья, солнце и вода помогают траве подрасти. Это любая энергия, наполняющая, обновляющая, рождающая и кормящая – дающая результат. В скандинавском футарке схожие значения с Есть имеют руны Беркана и Эйваз. В раскладах данная скандинавская руна символизирует улучшение ситуации и ее укрепление, фиксацию достигнутого результата – изобилие, достаток, богатство, имущество, приобретение, добро, выздоровление']

      ge=['0111', '7', 'живите', 'рун_нет']

      z1=['1000', '8', 'зело', 'рун_нет']

      z2=['1001', '9', 'земля', 'рун_нет']

      i1=['1010', '10', 'ижи', 'исток','Основные смыслы: лед, неподвижность, основа, начало, исходная точка, основание, корень   Руна Исток – постепенное накопление мощи. Она сигнализирует, что внешние условия пока не созрели, внутреннее «я» не готово к переменам, время действий еще не настало. Прообраз «мертвой воды», созидающей крепкую структуру тела и очищающей в посмертии. В представлении славян, это полет во сне к Морозко – воплощение мужского начала бессознательного или к Госпоже Метелице – воплощение женское;','Руна Исток В славянском рунном алфавите символизирует букву И Перевод и значение славянской руны: В скандинавском футарке существует аналог Истоку – руна Иса, в некоторых ситуациях и Хагалаз. Славянская же руна, в отличие от трактовки рунического северного ряда – не только лед как символ сотворения мира из одной единственной градинки-зернышка или же состояние неподвижности, заморозки для способа нейтрализации. Наш Исток – это основа и стержень, сила начала и движения, развитие ситуации. Исток – это сам смысл жизни или цель, то что истекает куда-то, питает что-то и рождает кого-то.']

      i2=['10100', '20', 'иже', 'исток','Основные смыслы: лед, неподвижность, основа, начало, исходная точка, основание, корень   Руна Исток – постепенное накопление мощи. Она сигнализирует, что внешние условия пока не созрели, внутреннее «я» не готово к переменам, время действий еще не настало. Прообраз «мертвой воды», созидающей крепкую структуру тела и очищающей в посмертии. В представлении славян, это полет во сне к Морозко – воплощение мужского начала бессознательного или к Госпоже Метелице – воплощение женское;','Руна Исток В славянском рунном алфавите символизирует букву И Перевод и значение славянской руны: В скандинавском футарке существует аналог Истоку – руна Иса, в некоторых ситуациях и Хагалаз. Славянская же руна, в отличие от трактовки рунического северного ряда – не только лед как символ сотворения мира из одной единственной градинки-зернышка или же состояние неподвижности, заморозки для способа нейтрализации. Наш Исток – это основа и стержень, сила начала и движения, развитие ситуации. Исток – это сам смысл жизни или цель, то что истекает куда-то, питает что-то и рождает кого-то.']

      k=['11110', '40', 'како', 'крада','Основные смыслы: Правда, Огонь, Воплощение, глагол-действие   Руна Крада – воплощение мирового Огня, как потребности духовного развития. Ее значение противопоставлено руне Есть, отвечающей за физические потребности. Символизирует одновременно священный огонь и приносимую ему жертву;','Руна Крада В славянском рунном алфавите символизирует буквы Г и КОсновные смыслы: Правда, Огонь, Воплощение, глагол-действиеПеревод и значение славянской руны: Крада – это жертвенный огонь, зажигающийся для Богов не только при сжигании усопших, но и при принесении треб, ритуалах и просьбы совета или помощи в трудных делах. Этот огонь сжигает, убирает все ненужное, мешающее, очищает и открывает путь. Самые главные значения Крады в работе: избавление, признание, стремление к цели, знание и жажда познать, благодарность и выбор.В скандинавском футарке эта руна более всего соответствует Квеорту. Такое же четкое действие – сильное и необратимое, такая же сила огня и воплощение Божественной силы и замысла. Огонь – это дар Богов людям, поэтому в некоторой степени значению славянской руны Крада соотвествуют скандинавские Кано и Гебо. Это руна действия, глагола – воплощения поставленной цели и намерений. В магии Крада очищает каналы, высвобождает желания и помогает их реализации.']

      l=['101000', '50', 'люди', 'леля','Основные смыслы: Леля, любовь, вода, влечение   Руна Леля – сущность Богини-Матери, где она предстает в образе вечномолодой женщины-ребенка, чья цель – рождение и появление нового. Славянские источники изображают Лелю вершиной родового древа, покровительницей ребенка, в которого устремлена вся энергия, мощь и сила древа Рода, надежды и чаяния предков;','Руна Леля В славянском рунном алфавите символизирует букву Л Перевод и значение славянской руны: Леля, как и продолжение Лады – это молодость, красота, весна, чистые ручьи и таяние холодного снега. В значении руны скрыты любовь, семья, дети, ведовство, интуиция, радость. В магическом аспекте Леля пробуждает интуицию и силу, отправление в поиски за Истинным. Скандинавский футарк имеет сходную по значению руну Лагуз, и по некоторым критериям эта славянская руна сходна с действием Вуньо.Леля издревле почиталась своими сынами-славянами как дочь Великой Матери. От ее имени произошло множество однокоренных, очень теплых и мягких, главных по силе и значению в жизни человека слов: ляля – ребенок, лелеять и прочие. Будучи сестрой Яровита, владеющего стихией огня, Леля же связана со стихией воды – чистой и постоянно двигающейся, бегущей по ручьям и рекам, поящей родники.Под разными именами мы встречаем Лелю как богиню силы во многих культурах и сказаниях: морская или речная дева, хранительница священного Грааля и путей к нему, она ведет за собой так же уверенно и целенаправленно как течет водный поток, и ничто не остановит ее на пути к цели. Ее не поймать и не заключить в оковы, однако она обволакивает и струится, наполняя все живое спасительной влагой, смывая горести и печали.']

      m=['110010', '60', 'мыслите', 'мир','Основные смыслы: Белбог, Древо Мира, внутреннее Я        Руна Белбог – стремление к высшей цели, обозначение программ реализации общемирового развития. В славянской мифологии она принадлежит Роду – самому старому из богов, который властен над глубинными знаниями, определяющими силу рода. Эти знания накапливаются с каждым новым поколением для наиболее эффективного достижения высшей цели, возвышения рода, развития Жизни в форме все более совершенных людей – детей;','Руна Мир В славянском рунном алфавите символизирует букву М Перевод и значение славянской руны: получение помощи, ответа, защиты, понимание ситуации, обращение к Богам и получение покоя и благ, переосмысление и переоценка имеющихся ценностей. Руна будет принуждать к поступку не с точки зрения справедливости, а концепции самого Добра и Блага. Поэтому никогда не используйте ее при негативных воздействиях или попытке повернуть ситуацию в свою пользу.Мир, руна Белбога в традиционном славянском представлении является образом Бога и Человека как его воплощения в Яви. Ось мироздания – мировое Родовое Древо, так же и позвоночник остов человека – то главное, что является основой Мира. Сама славянская руна символизирует и Дерево, растущее вверх, и человека, с поднятыми вверх руками. Одно из главных значений слова мир – род, общество, община, в которых непременно есть свой Порядок, призывающий соблюдать Законы.В скандинавском футарке значение славянской руны Мир передают две руны: Манназ - как образ Человека, личности и Альгиз – как образ Бога. Сам же образ БелБога параллелен Хеймдалю, или же Белому Асу. Как и славянский Белый Бог, Хеймдаль охраняет Пределы от сил Хаоса, является главным стражем Порядка.']

      n=['111100', '70', 'наш', 'нужда','Основные смыслы: Вий, Навь, Судьба, Кривда, неизбежность     Руна Нужда – следование собственному закону-порядку, видящему цель и понимающему, зачем человеку нужны самоограничения. Человек осознает неизбежность, но это знание используется для собственной выгоды;','Руна Нужда В славянском рунном алфавите символизирует букву Н Перевод и значение славянской руны: это руна адского огня, причиняющего боль, заслужившим такую участь. В положительном смысле – это признание своих проблем, потребностей и желаний, какими они бы ни были. В отрицательном – давление и принуждение, трудности, неволя, бедность горькое и тяжкое существование.  Обращение к руне – это связь с темным ликом Велеса.Нужда – это руна Велеса в Образе Ния или иначе Вия, главного Бога Нижнего мира, Нави. Вий, страшный бог – его взгляд сжигает все живое, но этот огонь не дает света и заковывает в цепи, он дает ощущение безнадежности и пустоту. Но порой этот огонь нужен, чтобы развернуть коловрат дороги в нужном тебе направлении. В магии Нужда является запретом на какое-либо действие или предречением материальных трудностей, узами и цепями сознания, закрывающими истинную реальность мироздания.В скандинавском футарке эта скандинавская руна соответствует значению Наутиза.']

      o1=['1000110', '80', 'он', 'опора','Основные смыслы: Боги, Коло, Родина, кол, столб, опора  Руна Опора – шаманский транс, соединение сознания с другими частями «я», а затем и с самой вселенной. Прослеживается связь с родовым древом славян – дубом и с посохом Силы, служащим оберегом волхву, оружием воину и опорой калеке;','Руна Опора В славянском рунном алфавите символизирует букву О Перевод и значение славянской руны: Опора – это помощь и защита Богов, магический круг, зона воздействия, ключевая цель, твердость духа и стойкость личной позиции. В магии этой руной обозначают, как и Манназом, объект воздействия. Но при этом в футарке есть сходные по основному значению руны – Ансуз и Отал. Опора – это руна Богов, основание Мира. То есть именно столпами – опорами являются Боги и Мировое древо для всех людей. На нормандском бог и столб — «ass» / «ans» звучат практически одинаково. Ось Древа – это круглый столб, Кол, Коло. Окружность его – это замкнутый круг уважения и почитания Богов, следования своей судьбе. Опора – это жизнь с наследием Предков, Родина.']

      p=['1010000', '90', 'покой', 'перун','Основные смыслы: Справедливость, мощь, суд, покровительство Руна Перун – властная энергия, соединение с абсолютной мужской силой, управление. Ей благоволит Перун, повелитель великих Князей, воплощение управляющей силы небес. Перун – один из главных богов, который наряду с Родом и Велесом ведет нескончаемый спор о судьбах славян;','Руна Перун В славянском рунном алфавите символизирует букву П Основные смыслы: Справедливость, мощь, суд, покровительство Перевод и значение славянской руны: Перун – это, как и Сварог, бог справедливости. Однако Сварог за жалобу отвесит оплеуху и просто поставит на место, а Перун действует тверже – если враг не прав, он должен быть полностью побежден, вплоть до смерти. К нему обращаются только в полном осознании своей правоты. Тогда можно рассчитывать на справедливую кару и возмездие. Эта славянская руна – оберег Воина, идущего защищать свое мнение и свою Родину. Победа любой ценой, буйство, сила стихий – вот что содержит в себе эта руна.Ведь Перун – это громовержец, защищающий все миры от наступления Хаоса, сохраняющий Порядок и Правду. Это сила, могущество, прямолинейность и мужество.В скандинавском футарке наиболее приближенной к выше перечисленным качествам и способностям руны является Турисаз.']

      r=['1011010', '100', 'рцы', 'радуга','Основные смыслы: Дорога и Радость, Победа и Успех, Результат  Руна Радуга – священный мост меж мирами, пройти по которому могут лишь достойные. Ей покровительствует Рада, дающая правильные советы и направляющая по жизненной дороге богиня;','Руна Радуга В славянском рунном алфавите символизирует букву Р Перевод и значение славянской руны: Радуга – это кратчайший путь от точки А до точки Б, это соединяющий два берега реки небесный мост. Это путь, путешествие, максимальное приближение желаемого, в том числе и с помощью магии, вмешательства Богов. Это установление контакта и радость от общения, успешный итог мероприятия. Дорога – это состояние движения между Порядком и Хаосом. У дороги нет начала и конца, но есть Источник, Точка первого шага и Итог. Известный девиз «делай, что должен и будь, что будет» – отличная иллюстрация к руне Радуга. У радужного пути есть сердце, и ведет руна к Алатырю. Траекторию пути, скорость движения и другие параметры определяют вечное противоборство сил Чернобога и Белбога, гармоничное воздействие огня и воды, света и тьмы, дня и ночи. В скандинавском футарке руна Алатырь соответствует по общему значению: дороге, путешествую руне Райдо. Однако последняя символизирует время в путешествии, сам его факт и Путь, порой – длиной в целую жизнь. Остаться же жить на Радуге невозможно, ибо этот путь открывается Богами в конкретное время для конкретной цели.']

      s=['1100100', '200', 'слово', 'сила','Основные смыслы: Сила, обретение знаний и целостности     Руна Сила – знак Поворота судьбы, Соединения Противоположностей. Представляет циклические процессы природы, критическую ситуацию, когда две энергии доселе враждующие сливаются и гармонично дополняют друг друга. Близкий древнеславянский термин,','Руна Сила В славянском рунном алфавите символизирует букву СПеревод и значение славянской руны: Она обозначает абсолютно любую силу, действующую на кого-то или на что-то. Это также приложенное усилие – действие, которое изменяет ситуацию или предмет. Начало, воздействие, сосредоточенность, вызов Божественных и стихийных сил, призыв и способность принять в себя поток: все это ключевые характеристики данной руны. В скандинавском футарке Сила по своему значению соответствует руне Соулу. У нордов сила – это не только возможность и способность изменить весь мир и себя, но и следование выбранному пути без оков сознания, который разделяет мысль и бытие. Славяне также следовали такой логической трактовке и нарекали руну символом победы на своими путами и принесением в жертву себя внешнего ради настоящего – высвобождения Духа и собственного «Я». В магии применение этой славянской руны помогает направить вопрошающего на краткий, победный Путь и прояснить задаваемый вопрос, принять решение действовать.']

      t=['11001000', '300', 'твердо', 'треба','Основные смыслы: Воин, жертва, твердость духа     Руна Треба – Жертва богам, очищающая жертва, когда избавляешься от дорого, но уже тяготящего бремени богатства, знаний, таланта, карьеры и других подобных вещей. Жертва необходима самому ее приносящему, иначе чрезмерность может поглотить душу и заменить ее физическими благами. Здесь чем больше отдашь, тем больше и получишь. Славянские сказители воплотили эту истину в легенде о Герое, кормящем собственным телом Орла, несущего Героя из нижнего мира домой, в мир живых;','Руна Треба В славянском рунном алфавите символизирует букву Т Перевод и значение славянской руны: Это руна воина-странника на дороге к главному – Алатырю. Это руна установления своих правил, требований и если нужно – и жертвы. В игре правила не нарушают. Именно их соблюдение, тщательное изучение и следование им и ведет к победе.Однако каждая игра и достижение победы подразумевают соперничество, сражение, соревнование – войну. Преодоление трудностей, цель, распределение сил, их трата, достижения, умения, необходимость – вот главные определяющие символику руны Треба слова. Треба схожа по значению со скандинавской руной Тейваз. В северных сказах есть такое предание: когда Боги поймали Фернира – Волка, влекущего за собой Рагнарок, конец Мира, нужно было наложить на зверя крепкие путы для защиты от его силы и действий. Однако сделать это можно было только хитростью. Обещая Ферниру, что Боги только испытают путы и потом снимут их, Тюр положил волку в пасть свою руку как залог обещанного. Путы были наложены, однако не сняты и Фернир откусил руку Тюру. Этой ценой была достигнута победа над Хаосом и продолжение Мира.Именно неизбежное приношение в жертву чего-либо и подразумевают Тейваз и Треба. Однако не простое жертвоприношение, а принесение в жертву самого главного – самого себя. Воин Духа светлым огнем такой жертвы побеждает оковы сознания и находит путь к Алатырю, дарующему Силу и Знания.']

      y=['100101100', '400', 'ук', 'уд','Основные смыслы: Яровит, Яр, Ярило, огонь, любовь, страсть, юность      Руна Уд – символ Бога-мужа, совершенная мужская энергия. Представляется в виде бога с оленьими рогами и неуемной сексуальной силой. Считалось, что оберег с изображением Уд, увеличивает мужскую силу. Ей покровительствует Купала;','Руна Уд В славянском рунном алфавите символизирует букву У Перевод и значение славянской руны: Уд символизирует сына Велеса, Яровита или же сына скандинавского бога Одина, Бальдра. Руна несет его можною силы, делающую женщин женственными, а всех мужчин мужественными –  Ярь. В скандинавском футарке Уд соответствует руна Уруз и немного по своим значениям и Ингуз. Это сила – объединяющая два противоположных начала и рождающая новую жизнь, это огонь любви и страсть, творческая вспышка и влечение. Неслучайно слово Уд воспринимается еще как и конечность, член, фаллос – символ плодородия и преображения Хаоса, превращение пустоты в Бытие.Ярило как руна Уд – это весна, это цветение, пробуждение живого и радость. Это страстные отношения между парой, зачатие, тепло, рост, секс, желание, красота и молодость.']

      f=['110010000', '500', 'ферт', 'рун_нет']

      x=['111110100', '600', 'хер', 'рок','Основные смыслы: Рок, Дух, судьба, непознанное, скрытое       Руна Рок – Сила Порядка, действий в рамках жесткой структуры мира, определяемой богами. Символизирует Рок – понятие редкое для мировоззрения славян. Это не римский Фатум, от которого не убежать, а скорее великие Законы Природы соответственно которым необходимо жить человеку;','Руна Рок В славянском рунном алфавите символизирует букву Х Перевод и значение славянской руны: Это карма, предопределение, судьба, неизбежность – это Рок, уготованный Богами. Это отсутствие вариантов, выхода, решимости, но также и важное событие, надежда на лучшую долю.Комментарии: сложная руна, руна предопределенности, руна кармы. Ее девиз «чему быть – того не миновать».На самом деле Рок – это не трансформировавшийся в плоть или визуальное обличье Дух, его можно только ощущать и понимать. Даже Боги не могут изменить уготованного Роком – ведь он нигде и везде, и это структура всех миров: Яви, Нави и Прави. Часто при раскладах или в магии выпадающий на долю человека Рок – это переход из одной формы в другую, вступление в Игру Высших Сил и абсолютно непредсказуемый, известный лишь отдельный ведунам исход.В скандинавском футарке есть близкие по смыслу руны Хагалаз, Эйваз и Перт, однако ни одна из них не отражает силу славянской руны Рок полностью. Также сходны по значению с Роком Эар, Квеорт и Гар – нортумбийские рунные символы.']

      o2=['1001011000', '700', 'от(омега)', 'опора','Основные смыслы: Боги, Коло, Родина, кол, столб, опора       Руна Опора – шаманский транс, соединение сознания с другими частями «я», а затем и с самой вселенной. Прослеживается связь с родовым древом славян – дубом и с посохом Силы, служащим оберегом волхву, оружием воину и опорой калеке;','Руна Опора В славянском рунном алфавите символизирует букву О Перевод и значение славянской руны: Опора – это помощь и защита Богов, магический круг, зона воздействия, ключевая цель, твердость духа и стойкость личной позиции. В магии этой руной обозначают, как и Манназом, объект воздействия. Но при этом в футарке есть сходные по основному значению руны – Ансуз и Отал.Опора – это руна Богов, основание Мира. То есть именно столпами – опорами являются Боги и Мировое древо для всех людей. На нормандском бог и столб — «ass» / «ans» звучат практически одинаково. Ось Древа – это круглый столб, Кол, Коло. Окружность его – это замкнутый круг уважения и почитания Богов, следования своей судьбе. Опора – это жизнь с наследием Предков, Родина.']

      ci=['1010111100', '900', 'цы', 'чернобог','Основные смыслы: Чернобог, перевернутое Мировое Древо, тень, шут      Руна Чернобог – воплощение Бога-трикстера, правителя «той стороны» всегда скрытого в тени, помогающего открыть в себе глубинные, потаенные силы;','Руна Чернобог В славянском рунном алфавите символизирует букву Ч или Ц Перевод и значение славянской руны: в противовес Белбогу Чернобог – абсолютное зло. Чтобы на Пути и в Жизни появилось место для чего-то нового, хорошего – нужно разрушить старое, ненужное. Хотите новой любви, приготовьтесь потерять прошлые воспоминания, и т.д. Чернобог и Белбог – это две стороны Бытия, две грани Равновесия. Руны Мир (Белбог) и Чернобог вместе производят Рок, руну Судьбы. Значение самой руны при переводе: изменение и разрушение, причинение вреда даже в благих целях (например – проведение операции), двойное дно, скрытое присутствие и негативное воздействие.Если Чернобог защищает от воздействия Хаоса и охраняет мировой Порядок, то Чернобог связывает нас с дорогами и силами Хаоса. Однако считать абсолютное зло только негативным действием или силой будет неправильным, так как Человек состоит из добра и зла, и взгляд на тот или иной поступок и его причины будет абсолютно разными в разных ситуациях.Именно поэтому существование и взаимодействие Добра и Зла неизменно в ПриРоде и постоянно стремится к Равновесию этих центробежных сил, влияющих на сам Мир.Руна Чернобога – это бог-трикстер, Шут и Паяц, сражающийся со стражем Порядка и нарушающий установленные Границы. По отношению к человеку руна – тень за нашим левым плечом, которая играючи ведет нас к срыванию личин и разрушению иллюзий. В магии Чернобог помогает разрешать старые ненужные связи и прорываться из замкнутого круга.В скандинавском футарке руна Чернобог находит большие совпадения в руне Хагалаз и отчасти – в Перте. Одним из образов Чернобога является вездесущий шутник и разрушитель Локи.']

      ch=['1110000100', '1000', 'червь', 'чернобог','Основные смыслы: Чернобог, перевернутое Мировое Древо, тень, шут      Руна Чернобог – воплощение Бога-трикстера, правителя «той стороны» всегда скрытого в тени, помогающего открыть в себе глубинные, потаенные силы;','Руна Чернобог В славянском рунном алфавите символизирует букву Ч или Ц Перевод и значение славянской руны: в противовес Белбогу Чернобог – абсолютное зло. Чтобы на Пути и в Жизни появилось место для чего-то нового, хорошего – нужно разрушить старое, ненужное. Хотите новой любви, приготовьтесь потерять прошлые воспоминания, и т.д. Чернобог и Белбог – это две стороны Бытия, две грани Равновесия. Руны Мир (Белбог) и Чернобог вместе производят Рок, руну Судьбы. Значение самой руны при переводе: изменение и разрушение, причинение вреда даже в благих целях (например – проведение операции), двойное дно, скрытое присутствие и негативное воздействие.Если Чернобог защищает от воздействия Хаоса и охраняет мировой Порядок, то Чернобог связывает нас с дорогами и силами Хаоса. Однако считать абсолютное зло только негативным действием или силой будет неправильным, так как Человек состоит из добра и зла, и взгляд на тот или иной поступок и его причины будет абсолютно разными в разных ситуациях.Именно поэтому существование и взаимодействие Добра и Зла неизменно в ПриРоде и постоянно стремится к Равновесию этих центробежных сил, влияющих на сам Мир.Руна Чернобога – это бог-трикстер, Шут и Паяц, сражающийся со стражем Порядка и нарушающий установленные Границы. По отношению к человеку руна – тень за нашим левым плечом, которая играючи ведет нас к срыванию личин и разрушению иллюзий. В магии Чернобог помогает разрешать старые ненужные связи и прорываться из замкнутого круга.В скандинавском футарке руна Чернобог находит большие совпадения в руне Хагалаз и отчасти – в Перте. Одним из образов Чернобога является вездесущий шутник и разрушитель Локи.']

      sh=['0000','0','ша','рун_нет']

      shi=['1111101000', '800', 'шта', 'рун_нет']

      er=['0000', '0', 'ер', 'рун_нет']

      ere=['0000', '0', 'еры', 'рун_нет']

      eri=['0000', '0', 'ерь', 'рун_нет']

      ee=['0110', '6', 'есть', 'рун_нет']

      yu=['0000', '0', 'ю', 'рун_нет']

      yt=['0000', '0', 'ять', 'рун_нет']



      mir=[]
      ds=[]
      cs=[]
      gl=[]
      ru=[]
      rs=[]
      orun=[]


      for slovo[0] in slovo:
              if(slovo==str):
                          print('slovo')
                          ds.append(slovo)
                          cs.append('ТОЛЬКО СИМВОЛЫ КИЛИЛИЦЫ')
                          gl.append('ТОЛЬКО СИМВОЛЫ КИЛИЛИЦЫ')
                          ru.append('ТОЛЬКО СИМВОЛЫ КИЛИЛИЦЫ')
                          rs.append('только кирилица')
                          orun.append('njkmrj rbhbkbwf')
              elif(slovo[0]=='а'):
                          ds.append(a[0])
                          cs.append(a[1])
                          gl.append(a[2]+'')
                          ru.append(a[3])
                          rs.append(a[4])
                          rs.append('........................................................................................................................................................................................')
                          orun.append(a[5])
                          orun.append('......................................................................................................................................................................................')
              elif(slovo[0]=='б'):
                          ds.append(b[0])
                          cs.append(b[1])
                          gl.append(b[2]+'')
                          ru.append(b[3])
                          rs.append(b[4])
                          rs.append('........................................................................................................................................................................................')
                          orun.append(b[5])
                          orun.append('......................................................................................................................................................................................')
              elif(slovo[0]=='в'):
                          ds.append(v[0])
                          cs.append(v[1])
                          gl.append(v[2]+'')
                          ru.append(v[3])
                          rs.append(v[4])
                          rs.append('........................................................................................................................................................................................')
                          orun.append(v[5])
                          orun.append('......................................................................................................................................................................................')
              elif(slovo[0]=='г'):
                          ds.append(g[0])
                          cs.append(g[1])
                          gl.append(g[2]+'')
                          ru.append(g[3])
                          rs.append(g[4])
                          rs.append('........................................................................................................................................................................................')
                          orun.append(k[5])
                          orun.append('......................................................................................................................................................................................')
              elif(slovo[0]=='д'):
                          ds.append(d[0])
                          cs.append(d[1])
                          gl.append(d[2]+'')
                          ru.append(d[3])
                          rs.append(d[4])
                          rs.append('........................................................................................................................................................................................')
                          orun.append(d[5])
                          orun.append('......................................................................................................................................................................................')
              elif(slovo[0]=='е'):
                          ds.append(e[0])
                          cs.append(e[1])
                          gl.append(e[2]+'')
                          ru.append(e[3])
                          rs.append(e[4])
                          rs.append('........................................................................................................................................................................................')
                          orun.append(e[5])
                          orun.append('......................................................................................................................................................................................')
              elif(slovo[0]=='ё'):
                          ds.append(e[0])
                          cs.append(e[1])
                          gl.append(e[2]+'')
                          ru.append(e[3])
              elif(slovo[0]=='ж'):
                          ds.append(ge[0])
                          cs.append(ge[1])
                          gl.append(ge[2]+'')
                          ru.append(ge[3])
              elif(slovo[0]=='з'):
                          ds.append(z1[0])
                          ds.append(z2[0])
                          cs.append(z1[1])
                          cs.append(z2[1])
                          gl.append(z1[2])
                          gl.append('ЗАВИСИТ ОТ ПОТОДЕНИЯ')
                          gl.append(z2[2]+'')
                          ru.append(z1[3])
                          ru.append(z2[3])
              elif(slovo[0]=='и'):
                          ds.append(i1[0])
                          cs.append(i1[1])
                          gl.append(i1[2]+'')
                          ru.append(i1[3])
                          rs.append(i1[4])
                          rs.append('........................................................................................................................................................................................')
                          orun.append(i1[5])
                          orun.append('......................................................................................................................................................................................')
              elif(slovo[0]=='й'):
                          ds.append(i2[0])
                          cs.append(i2[1])
                          gl.append(i2[2]+'')
                          ru.append(i2[3])
                          rs.append(i2[4])
                          rs.append('........................................................................................................................................................................................')
                          orun.append(i2[5])
                          orun.append('......................................................................................................................................................................................')
              elif(slovo[0]=='к'):
                          ds.append(k[0])
                          cs.append(k[1])
                          gl.append(k[2]+'')
                          ru.append(k[3])
                          rs.append(k[4])
                          orun.append(k[5])
              elif(slovo[0]=='л'):
                          ds.append(l[0])
                          cs.append(l[1])
                          gl.append(l[2]+'')
                          ru.append(l[3])
                          rs.append(l[4])
                          rs.append('........................................................................................................................................................................................')
                          orun.append(l[5])
                          orun.append('......................................................................................................................................................................................')
              elif(slovo[0]=='м'):
                          ds.append(m[0])
                          cs.append(m[1])
                          gl.append(m[2]+'')
                          ru.append(m[3])
                          rs.append(m[4])
                          rs.append('........................................................................................................................................................................................')
                          orun.append(m[5])
                          orun.append('......................................................................................................................................................................................')
              elif(slovo[0]=='н'):
                          ds.append(n[0])
                          cs.append(n[1])
                          gl.append(n[2]+'')
                          ru.append(n[3])
                          rs.append(n[4])
                          rs.append('........................................................................................................................................................................................')
                          orun.append(n[5])
                          orun.append('......................................................................................................................................................................................')
              elif(slovo[0]=='о'):
                          ds.append(o1[0])
                          ds.append(o2[0])
                          cs.append(o1[1])
                          cs.append(o2[1])
                          gl.append(o1[2])
                          gl.append('_"зависит от положения"_')
                          gl.append(o2[2]+'')
                          ru.append(o1[3])
                          rs.append(o1[4])
                          rs.append('........................................................................................................................................................................................')
                          orun.append(o1[5])
                          orun.append('......................................................................................................................................................................................')
              elif(slovo[0]=='п'):
                          ds.append(p[0])
                          cs.append(p[1])
                          gl.append(p[2]+'')
                          ru.append(p[3])
                          rs.append(p[4])
                          rs.append('........................................................................................................................................................................................')
                          orun.append(p[5])
                          orun.append('......................................................................................................................................................................................')
              elif(slovo[0]=='р'):
                          ds.append(r[0])
                          cs.append(r[1])
                          gl.append(r[2]+'')
                          ru.append(r[3])
                          rs.append(r[4])
                          rs.append('........................................................................................................................................................................................')
                          orun.append(r[5])
                          orun.append('......................................................................................................................................................................................')
              elif(slovo[0]=='с'):
                          ds.append(s[0])
                          cs.append(s[1])
                          gl.append(s[2]+'')
                          ru.append(s[3])
                          rs.append(s[4])
                          rs.append('........................................................................................................................................................................................')
                          orun.append(s[5])
                          orun.append('......................................................................................................................................................................................')
              elif(slovo[0]=='т'):
                          ds.append(t[0])
                          cs.append(t[1])
                          gl.append(t[2]+'')
                          ru.append(t[3])
                          rs.append(t[4])
                          rs.append('........................................................................................................................................................................................')
                          orun.append(t[5])
                          orun.append('......................................................................................................................................................................................')
              elif(slovo[0]=='у'):
                          ds.append(y[0])
                          cs.append(y[1])
                          gl.append(y[2]+'')
                          ru.append(y[3])
                          rs.append(y[4])
                          rs.append('........................................................................................................................................................................................')
                          orun.append(y[5])
                          orun.append('......................................................................................................................................................................................')
              elif(slovo[0]=='ф'):
                          ds.append(f[0])
                          cs.append(f[1])
                          gl.append(f[2]+'')
                          ru.append(f[3])
              elif(slovo[0]=='х'):
                          ds.append(x[0])
                          cs.append(x[1])
                          gl.append(x[2]+'')
                          ru.append(x[3])
                          rs.append(x[4])
                          rs.append('........................................................................................................................................................................................')
                          orun.append(x[5])
                          orun.append('......................................................................................................................................................................................')
              elif(slovo[0]=='ц'):
                          ds.append(ci[0])
                          cs.append(ci[1])
                          gl.append(ci[2]+'')
                          ru.append(ci[3])
                          rs.append(ci[4])
                          rs.append('........................................................................................................................................................................................')
                          orun.append(ci[5])
                          orun.append('......................................................................................................................................................................................')
              elif(slovo[0]=='ч'):
                          ds.append(ch[0])
                          cs.append(ch[1])
                          gl.append(ch[2]+'')
                          ru.append(ch[3])
                          rs.append(ch[4])
                          rs.append('........................................................................................................................................................................................')
                          orun.append(ch[5])
                          orun.append('......................................................................................................................................................................................')
              elif(slovo[0]=='ш'):
                          ds.append(sh[0])
                          cs.append(sh[1])
                          gl.append(sh[2]+'')
                          ru.append(sh[3])
                          rs.append(sh[4])
              elif(slovo[0]=='щ'):
                          ds.append(shi[0])
                          cs.append(shi[1])
                          gl.append(shi[2])
                          ru.append(shi[3])
                          rs.append(shi[4])
                          orun.append(shi[5])
              elif(slovo[0]=='ъ'):
                          ds.append(er[0])
                          cs.append(er[1])
                          gl.append(er[2]+'')
                          ru.append(er[3])
              elif(slovo[0]=='ы'):
                          ds.append(ere[0])
                          cs.append(ere[1])
                          gl.append(ere[2]+'')
                          ru.append(ere[3])	
              elif(slovo[0]=='ь'):
                          ds.append(eri[0])
                          cs.append(eri[1])
                          gl.append(eri[2]+'')
                          ru.append(eri[3])
              elif(slovo[0]=='э'):
                          ds.append(ee[0])
                          cs.append(ee[1])
                          gl.append(ee[2]+'')
                          ru.append(ee[3])
                          rs.append(ee[4])
                          orun.append(ee[5])
              elif(slovo[0]=='ю'):
                          ds.append(yu[0])
                          cs.append(yu[1])
                          gl.append(yu[2]+'')
                          ru.append(yu[3])
              elif(slovo[0]=='я'):
                          ds.append(yt[0])
                          cs.append(yt[1])
                          gl.append(yt[2])
                          ru.append(yt[3])
              else:
                    (slovo[0]=='.')
                  
              print('\n Перевод завершен............ДВОИЧНАЯ СИСТЕМА..............\n\n')
              print(ds)
              mir.append(ds)
              print('\n Перевод завершен............ЦИФРОВОЕ ЗНАЧЕНИЕ.............\n\n')
              print(cs)



              print('\n Перевод завершен............ГЛАГОЛИТЦА.....................\n\n')
                
                  
              print(gl)           
                  
              print('\n Перевод завершен..........СЛАВЯНСКИЕ РУНЫ..................\n\n')
              print(ru)
              print('\n\n\n.........................................................\n\n')



              print('\n\n Перевод завершен............ОБРАЗ РУНЫ..............///////////////\n\n\n\n')

              print(rs)
              print('\n\n\n...........................описание рун................................\n\n')
      
              print(orun)

              del  slovo[:]
              del  cs[:]
              del  gl[:]
              del  ru[:]
              del  rs[:]
              del  orun[:]




slovo00=input('ГлОгОлИ, пОвЕдАю: \n:')

slovo=list(slovo00)

set(slovo)
a=['1','1','аз','алатырь','Основные смыслы: Мировая года, Священный Грааль, Азы, Начало, Величие///Руна Алатырь – отражение глубокой стабильности «я», когда на человека не влияют внешние и внутренние факторы. Достижение абсолютного покоя, в котором любое принятое решение станет единственно верным, изменит жизнь к лучшему. Алатыть – это Горюч-Камень, семя Земли, взятое Демиургом со дна древнего Океана и давшее плоды тверди','Руна АлатырьВ славянском рунном алфавите символизирует букву А Перевод и значение славянской руны: Алатырь – это Начало, точка преткновения, вокруг которой крутится Мир. Алатырь есть везде и нигде, он и легок и тяжел, он и мал и велик. Это чистая энергия, магия – это с чего начинается Все. Главные значения руны Алатырь в силе, знаниях, возможностях. Цикличности, стабильности, лечении, восстановлении, указании пути – открытия дорог и перспектив.В скандинавском футарке нет ни одной руны, полностью передающей значение Алатыря. Лишь в некоторой степени можно привести в сравнение руну Йера и Стан из нортумбрийского ряда рун.Алатырь – это Мировая гора, центр Мира. Именно вокруг Алатыря идет вечная борьба Чернобога и Белбога, сражения и схватки сил Хаоса и Порядка – сохранение закона равновесия. Алатырь, камень-основа – поднятая Богами со дна Окияна горстка земли и перенесенная на Буян-Остров в открытое море.Под Алатырем берут начало все реки Мира и начинаются все дороги. Магические алтари для обращения к Прави и преподношения Треб – это символическое изображение Алатырь-камня, служащего троном главным Богам']

b=['10', '2', 'буки', 'берегиня','Основные смыслы: мать-Макошь, Земля, Судьба, береза Руна Берегиня – одна из ипостасей Богини-Женщины, хранительницы междумирья, сторожащей дорогу между потусторонним миром и миром живых. Традиционно охраняет весь род славян, молодых матерей и рожениц от происков сущностей нижнего мира.Древнеславянские и арийские женщины часто наносили руну на личные обереги. Одновременно она не пускает любопытных живых в мир предков. Прообраз Бабы-Яги, охраняющей границу леса и села; Русалки, стерегущей переход от суши к воде и т. д;','Руна Берегиня В славянском рунном алфавите символизирует букву Б Перевод и значение славянской руны: Работа с водой и землей, получение силы в новом начинании, удачи, достатка, благополучия, решения всех вопросов семьи и окончание неприятностей, защита, справедливость и покровительство – это главные свойства и значения руны Берегиня. Славится она и усилением таких качеств, как женская красота, мудрость, хитрость, зрелость и плодородие.Берегиня –  материнское начало, в славянских ведах под этим именем подразумевалась Богиня Макошь. Потому руна Матери-Макоши Берегиня ведает и земным плодородием, позволяющим жить людям, и вообще человеческими судьбами. Так как у Макоши две ипостаси – дневная и ночная, то и эта славянская руна в перевернутом значении бывает не только символом жизни, но и смерти. Только частью своих значений она походит на скандинавскую руну Беркана, а также образом Фригги, Небесной матери и Хель, Подземной Матери. По традиции Мать-Макошь как дает жизнь душам на земле, так и отнимает ее по прошествии времени, ткет человеческие судьбы вместе с помощью Доли и Недоли.Берегиня – это руна судьбы, так как Макошь порой считают продолжением Велеса, как супругу, а также руной силы стихии земли – тяжелой, могучей и благодарной за заботу.']

v=['11', '3', 'веди', 'ветер','Основные смыслы: Велес, Ветер, сила, ведун, знания,Руна Ветер – образ божественного наслаждения битвой, ветра, уносящего прочь все суетное, ветра Битвы, где смерть – лишь один из этапов поединка. Она родственна Коням, которые определяли у славян ход битвы и уносили павших за грань жизни;','Руна ВетерВ славянском рунном алфавите символизирует букву В Перевод и значение славянской руны: изменчивость, разрушение, окончание, уничтожение, стихийное бедствие, навевание, развеивание, очищение, возможности, скорость – вот в чем таится сила Ветра. Главное – научиться управлять ею и использовать осторожно в своих целях, задав правильный вектор движения. Как правило, в работе ее используют в комбинации с другими рунами именно для уточнения положительной или отрицательной позиции, а также для работы с внутренним Я, совершенствованием и развитием, вызове стихий и использовании энергии воздуха. На уровне магии руна Ветер символизирует магический круг и силу в нем, создавая вихрь и придавая скорости. Эта руна символизирует силу, мудрость, богатство и знания Велеса. Визуально она напоминается сдвоенную Требу – руну воина Духа. Так же, как и Треба, Ветер символизирует странника на пути к камню-Алатырю, направляющемуся за результатом и Силой. На эмоциональном уровне Ветер – это ярость, вдохновение, непреодолимое желание и действие.т их реализации']

g=['100', '4', 'глаголи', 'крада ','Руна Крада В славянском рунном алфавите символизирует буквы Г и К Перевод и значение славянской руны: Крада – это жертвенный огонь, зажигающийся для Богов не только при сжигании усопших, но и при принесении треб, ритуалах и просьбы совета или помощи в трудных делах. Этот огонь сжигает, убирает все ненужное, мешающее, очищает и открывает путь. Самые главные значения Крады в работе: избавление, признание, стремление к цели, знание и жажда познать, благодарность и выбор.В скандинавском футарке эта руна более всего соответствует Квеорту. Такое же четкое действие – сильное и необратимое, такая же сила огня и воплощение Божественной силы и замысла. Огонь – это дар Богов людям, поэтому в некоторой степени значению славянской руны Крада соотвествуют скандинавские Кано и Гебо. Это руна действия, глагола – воплощения поставленной цели и намерений. В магии Крада очищает каналы, высвобождает желания и помогает их реализации.']
         
d=['101', '5', 'добро', 'даждьбог','Основные смыслы: Дар, Добро, плодородие, достаток, богатство   Руна Даждьбог – обозначение древнего ритуала оплодотворения Небом Земли, который проводился славяно-арийскими племенами для получения хорошего урожая. Соответствует Даждьбогу – славянскому богу земледелия, покровителю плодородия;','Руна Даждьбог В славянском рунном алфавите символизирует букву Д Перевод и значение славянской руны: это персональная руна Даждьбога, его олицетворение. В отличие от Белбога, абсолютного Добра, Даждьбог понимает и заботится о своих потомках. Это мудрый дедушка, который может, как научить, так и наказать для пользы Рода. Он оставляет богатое наследство и помогает его приумножать. Постоянство и уверенность в завтрашнем дне, удача и достаток, прибыль и приумножение заработанного, ежедневный труд и получение результатов – вот что такое Даждьбог.В скандинавском футарке наиболее близкое значение к этой славянской руне имеют Феу и Йера. Однако при конкретных вопросах ее значение может совпадать с Дагазом, Ингузом и Гебо. Вообще – Даждьбог – это дар Богов и Предков, это возникновение новых связей, друзей и возможностей. Защита на пути к тому, что сделает крепким и сильным весь Род, успешный конец начатого. Скандинавы знали Даджьбога под именем Фрейр, а культы называли его Дагдой – это клад всех возможных и желаемых благ, мудрые советы и зоркое око дедушки.']
         
e=['110', '6', 'есть', 'есть','Основные смыслы: Жизнь, движение, естественный ход событий','Руна Есть – изначальная Мать-Богиня, абсолютное воплощение женского начала у славян. Принадлежит Живе – хранительнице жизни,Руна Есть В славянском рунном алфавите символизирует букву Е Перевод и значение славянской руны: Есть – это данность, это жизнь и ее течение: силы сока земли текут по корням и питают деревья, солнце и вода помогают траве подрасти. Это любая энергия, наполняющая, обновляющая, рождающая и кормящая – дающая результат. В скандинавском футарке схожие значения с Есть имеют руны Беркана и Эйваз. В раскладах данная скандинавская руна символизирует улучшение ситуации и ее укрепление, фиксацию достигнутого результата – изобилие, достаток, богатство, имущество, приобретение, добро, выздоровление']

ge=['111', '7', 'живите', 'рун_нет']

z1=['1000', '8', 'зело', 'рун_нет']

z2=['1001', '9', 'земля', 'рун_нет']

i1=['1010', '10', 'ижи', 'исток','Основные смыслы: лед, неподвижность, основа, начало, исходная точка, основание, корень   Руна Исток – постепенное накопление мощи. Она сигнализирует, что внешние условия пока не созрели, внутреннее «я» не готово к переменам, время действий еще не настало. Прообраз «мертвой воды», созидающей крепкую структуру тела и очищающей в посмертии. В представлении славян, это полет во сне к Морозко – воплощение мужского начала бессознательного или к Госпоже Метелице – воплощение женское;','Руна Исток В славянском рунном алфавите символизирует букву И Перевод и значение славянской руны: В скандинавском футарке существует аналог Истоку – руна Иса, в некоторых ситуациях и Хагалаз. Славянская же руна, в отличие от трактовки рунического северного ряда – не только лед как символ сотворения мира из одной единственной градинки-зернышка или же состояние неподвижности, заморозки для способа нейтрализации. Наш Исток – это основа и стержень, сила начала и движения, развитие ситуации. Исток – это сам смысл жизни или цель, то что истекает куда-то, питает что-то и рождает кого-то.']

i2=['10100', '20', 'иже', 'исток','Основные смыслы: лед, неподвижность, основа, начало, исходная точка, основание, корень   Руна Исток – постепенное накопление мощи. Она сигнализирует, что внешние условия пока не созрели, внутреннее «я» не готово к переменам, время действий еще не настало. Прообраз «мертвой воды», созидающей крепкую структуру тела и очищающей в посмертии. В представлении славян, это полет во сне к Морозко – воплощение мужского начала бессознательного или к Госпоже Метелице – воплощение женское;','Руна Исток В славянском рунном алфавите символизирует букву И Перевод и значение славянской руны: В скандинавском футарке существует аналог Истоку – руна Иса, в некоторых ситуациях и Хагалаз. Славянская же руна, в отличие от трактовки рунического северного ряда – не только лед как символ сотворения мира из одной единственной градинки-зернышка или же состояние неподвижности, заморозки для способа нейтрализации. Наш Исток – это основа и стержень, сила начала и движения, развитие ситуации. Исток – это сам смысл жизни или цель, то что истекает куда-то, питает что-то и рождает кого-то.']

k=['11110', '40', 'како', 'крада','Основные смыслы: Правда, Огонь, Воплощение, глагол-действие   Руна Крада – воплощение мирового Огня, как потребности духовного развития. Ее значение противопоставлено руне Есть, отвечающей за физические потребности. Символизирует одновременно священный огонь и приносимую ему жертву;','Руна Крада В славянском рунном алфавите символизирует буквы Г и КОсновные смыслы: Правда, Огонь, Воплощение, глагол-действиеПеревод и значение славянской руны: Крада – это жертвенный огонь, зажигающийся для Богов не только при сжигании усопших, но и при принесении треб, ритуалах и просьбы совета или помощи в трудных делах. Этот огонь сжигает, убирает все ненужное, мешающее, очищает и открывает путь. Самые главные значения Крады в работе: избавление, признание, стремление к цели, знание и жажда познать, благодарность и выбор.В скандинавском футарке эта руна более всего соответствует Квеорту. Такое же четкое действие – сильное и необратимое, такая же сила огня и воплощение Божественной силы и замысла. Огонь – это дар Богов людям, поэтому в некоторой степени значению славянской руны Крада соотвествуют скандинавские Кано и Гебо. Это руна действия, глагола – воплощения поставленной цели и намерений. В магии Крада очищает каналы, высвобождает желания и помогает их реализации.']

l=['101000', '50', 'люди', 'леля','Основные смыслы: Леля, любовь, вода, влечение   Руна Леля – сущность Богини-Матери, где она предстает в образе вечномолодой женщины-ребенка, чья цель – рождение и появление нового. Славянские источники изображают Лелю вершиной родового древа, покровительницей ребенка, в которого устремлена вся энергия, мощь и сила древа Рода, надежды и чаяния предков;','Руна Леля В славянском рунном алфавите символизирует букву Л Перевод и значение славянской руны: Леля, как и продолжение Лады – это молодость, красота, весна, чистые ручьи и таяние холодного снега. В значении руны скрыты любовь, семья, дети, ведовство, интуиция, радость. В магическом аспекте Леля пробуждает интуицию и силу, отправление в поиски за Истинным. Скандинавский футарк имеет сходную по значению руну Лагуз, и по некоторым критериям эта славянская руна сходна с действием Вуньо.Леля издревле почиталась своими сынами-славянами как дочь Великой Матери. От ее имени произошло множество однокоренных, очень теплых и мягких, главных по силе и значению в жизни человека слов: ляля – ребенок, лелеять и прочие. Будучи сестрой Яровита, владеющего стихией огня, Леля же связана со стихией воды – чистой и постоянно двигающейся, бегущей по ручьям и рекам, поящей родники.Под разными именами мы встречаем Лелю как богиню силы во многих культурах и сказаниях: морская или речная дева, хранительница священного Грааля и путей к нему, она ведет за собой так же уверенно и целенаправленно как течет водный поток, и ничто не остановит ее на пути к цели. Ее не поймать и не заключить в оковы, однако она обволакивает и струится, наполняя все живое спасительной влагой, смывая горести и печали.']

m=['110010', '60', 'мыслите', 'мир','Основные смыслы: Белбог, Древо Мира, внутреннее Я        Руна Белбог – стремление к высшей цели, обозначение программ реализации общемирового развития. В славянской мифологии она принадлежит Роду – самому старому из богов, который властен над глубинными знаниями, определяющими силу рода. Эти знания накапливаются с каждым новым поколением для наиболее эффективного достижения высшей цели, возвышения рода, развития Жизни в форме все более совершенных людей – детей;','Руна Мир В славянском рунном алфавите символизирует букву М Перевод и значение славянской руны: получение помощи, ответа, защиты, понимание ситуации, обращение к Богам и получение покоя и благ, переосмысление и переоценка имеющихся ценностей. Руна будет принуждать к поступку не с точки зрения справедливости, а концепции самого Добра и Блага. Поэтому никогда не используйте ее при негативных воздействиях или попытке повернуть ситуацию в свою пользу.Мир, руна Белбога в традиционном славянском представлении является образом Бога и Человека как его воплощения в Яви. Ось мироздания – мировое Родовое Древо, так же и позвоночник остов человека – то главное, что является основой Мира. Сама славянская руна символизирует и Дерево, растущее вверх, и человека, с поднятыми вверх руками. Одно из главных значений слова мир – род, общество, община, в которых непременно есть свой Порядок, призывающий соблюдать Законы.В скандинавском футарке значение славянской руны Мир передают две руны: Манназ - как образ Человека, личности и Альгиз – как образ Бога. Сам же образ БелБога параллелен Хеймдалю, или же Белому Асу. Как и славянский Белый Бог, Хеймдаль охраняет Пределы от сил Хаоса, является главным стражем Порядка.']

n=['111100', '70', 'наш', 'нужда','Основные смыслы: Вий, Навь, Судьба, Кривда, неизбежность     Руна Нужда – следование собственному закону-порядку, видящему цель и понимающему, зачем человеку нужны самоограничения. Человек осознает неизбежность, но это знание используется для собственной выгоды;','Руна Нужда В славянском рунном алфавите символизирует букву Н Перевод и значение славянской руны: это руна адского огня, причиняющего боль, заслужившим такую участь. В положительном смысле – это признание своих проблем, потребностей и желаний, какими они бы ни были. В отрицательном – давление и принуждение, трудности, неволя, бедность горькое и тяжкое существование.  Обращение к руне – это связь с темным ликом Велеса.Нужда – это руна Велеса в Образе Ния или иначе Вия, главного Бога Нижнего мира, Нави. Вий, страшный бог – его взгляд сжигает все живое, но этот огонь не дает света и заковывает в цепи, он дает ощущение безнадежности и пустоту. Но порой этот огонь нужен, чтобы развернуть коловрат дороги в нужном тебе направлении. В магии Нужда является запретом на какое-либо действие или предречением материальных трудностей, узами и цепями сознания, закрывающими истинную реальность мироздания.В скандинавском футарке эта скандинавская руна соответствует значению Наутиза.']

o1=['1000110', '80', 'он', 'опора','Основные смыслы: Боги, Коло, Родина, кол, столб, опора  Руна Опора – шаманский транс, соединение сознания с другими частями «я», а затем и с самой вселенной. Прослеживается связь с родовым древом славян – дубом и с посохом Силы, служащим оберегом волхву, оружием воину и опорой калеке;','Руна Опора В славянском рунном алфавите символизирует букву О Перевод и значение славянской руны: Опора – это помощь и защита Богов, магический круг, зона воздействия, ключевая цель, твердость духа и стойкость личной позиции. В магии этой руной обозначают, как и Манназом, объект воздействия. Но при этом в футарке есть сходные по основному значению руны – Ансуз и Отал. Опора – это руна Богов, основание Мира. То есть именно столпами – опорами являются Боги и Мировое древо для всех людей. На нормандском бог и столб — «ass» / «ans» звучат практически одинаково. Ось Древа – это круглый столб, Кол, Коло. Окружность его – это замкнутый круг уважения и почитания Богов, следования своей судьбе. Опора – это жизнь с наследием Предков, Родина.']

p=['1010000', '90', 'покой', 'перун','Основные смыслы: Справедливость, мощь, суд, покровительство Руна Перун – властная энергия, соединение с абсолютной мужской силой, управление. Ей благоволит Перун, повелитель великих Князей, воплощение управляющей силы небес. Перун – один из главных богов, который наряду с Родом и Велесом ведет нескончаемый спор о судьбах славян;','Руна Перун В славянском рунном алфавите символизирует букву П Основные смыслы: Справедливость, мощь, суд, покровительство Перевод и значение славянской руны: Перун – это, как и Сварог, бог справедливости. Однако Сварог за жалобу отвесит оплеуху и просто поставит на место, а Перун действует тверже – если враг не прав, он должен быть полностью побежден, вплоть до смерти. К нему обращаются только в полном осознании своей правоты. Тогда можно рассчитывать на справедливую кару и возмездие. Эта славянская руна – оберег Воина, идущего защищать свое мнение и свою Родину. Победа любой ценой, буйство, сила стихий – вот что содержит в себе эта руна.Ведь Перун – это громовержец, защищающий все миры от наступления Хаоса, сохраняющий Порядок и Правду. Это сила, могущество, прямолинейность и мужество.В скандинавском футарке наиболее приближенной к выше перечисленным качествам и способностям руны является Турисаз.']

r=['1011010', '100', 'рцы', 'радуга','Основные смыслы: Дорога и Радость, Победа и Успех, Результат  Руна Радуга – священный мост меж мирами, пройти по которому могут лишь достойные. Ей покровительствует Рада, дающая правильные советы и направляющая по жизненной дороге богиня;','Руна Радуга В славянском рунном алфавите символизирует букву Р Перевод и значение славянской руны: Радуга – это кратчайший путь от точки А до точки Б, это соединяющий два берега реки небесный мост. Это путь, путешествие, максимальное приближение желаемого, в том числе и с помощью магии, вмешательства Богов. Это установление контакта и радость от общения, успешный итог мероприятия. Дорога – это состояние движения между Порядком и Хаосом. У дороги нет начала и конца, но есть Источник, Точка первого шага и Итог. Известный девиз «делай, что должен и будь, что будет» – отличная иллюстрация к руне Радуга. У радужного пути есть сердце, и ведет руна к Алатырю. Траекторию пути, скорость движения и другие параметры определяют вечное противоборство сил Чернобога и Белбога, гармоничное воздействие огня и воды, света и тьмы, дня и ночи. В скандинавском футарке руна Алатырь соответствует по общему значению: дороге, путешествую руне Райдо. Однако последняя символизирует время в путешествии, сам его факт и Путь, порой – длиной в целую жизнь. Остаться же жить на Радуге невозможно, ибо этот путь открывается Богами в конкретное время для конкретной цели.']

s=['1100100', '200', 'слово', 'сила','Основные смыслы: Сила, обретение знаний и целостности     Руна Сила – знак Поворота судьбы, Соединения Противоположностей. Представляет циклические процессы природы, критическую ситуацию, когда две энергии доселе враждующие сливаются и гармонично дополняют друг друга. Близкий древнеславянский термин,','Руна Сила В славянском рунном алфавите символизирует букву СПеревод и значение славянской руны: Она обозначает абсолютно любую силу, действующую на кого-то или на что-то. Это также приложенное усилие – действие, которое изменяет ситуацию или предмет. Начало, воздействие, сосредоточенность, вызов Божественных и стихийных сил, призыв и способность принять в себя поток: все это ключевые характеристики данной руны. В скандинавском футарке Сила по своему значению соответствует руне Соулу. У нордов сила – это не только возможность и способность изменить весь мир и себя, но и следование выбранному пути без оков сознания, который разделяет мысль и бытие. Славяне также следовали такой логической трактовке и нарекали руну символом победы на своими путами и принесением в жертву себя внешнего ради настоящего – высвобождения Духа и собственного «Я». В магии применение этой славянской руны помогает направить вопрошающего на краткий, победный Путь и прояснить задаваемый вопрос, принять решение действовать.']

t=['11001000', '300', 'твердо', 'треба','Основные смыслы: Воин, жертва, твердость духа     Руна Треба – Жертва богам, очищающая жертва, когда избавляешься от дорого, но уже тяготящего бремени богатства, знаний, таланта, карьеры и других подобных вещей. Жертва необходима самому ее приносящему, иначе чрезмерность может поглотить душу и заменить ее физическими благами. Здесь чем больше отдашь, тем больше и получишь. Славянские сказители воплотили эту истину в легенде о Герое, кормящем собственным телом Орла, несущего Героя из нижнего мира домой, в мир живых;','Руна Треба В славянском рунном алфавите символизирует букву Т Перевод и значение славянской руны: Это руна воина-странника на дороге к главному – Алатырю. Это руна установления своих правил, требований и если нужно – и жертвы. В игре правила не нарушают. Именно их соблюдение, тщательное изучение и следование им и ведет к победе.Однако каждая игра и достижение победы подразумевают соперничество, сражение, соревнование – войну. Преодоление трудностей, цель, распределение сил, их трата, достижения, умения, необходимость – вот главные определяющие символику руны Треба слова. Треба схожа по значению со скандинавской руной Тейваз. В северных сказах есть такое предание: когда Боги поймали Фернира – Волка, влекущего за собой Рагнарок, конец Мира, нужно было наложить на зверя крепкие путы для защиты от его силы и действий. Однако сделать это можно было только хитростью. Обещая Ферниру, что Боги только испытают путы и потом снимут их, Тюр положил волку в пасть свою руку как залог обещанного. Путы были наложены, однако не сняты и Фернир откусил руку Тюру. Этой ценой была достигнута победа над Хаосом и продолжение Мира.Именно неизбежное приношение в жертву чего-либо и подразумевают Тейваз и Треба. Однако не простое жертвоприношение, а принесение в жертву самого главного – самого себя. Воин Духа светлым огнем такой жертвы побеждает оковы сознания и находит путь к Алатырю, дарующему Силу и Знания.']

y=['100101100', '400', 'ук', 'уд','Основные смыслы: Яровит, Яр, Ярило, огонь, любовь, страсть, юность      Руна Уд – символ Бога-мужа, совершенная мужская энергия. Представляется в виде бога с оленьими рогами и неуемной сексуальной силой. Считалось, что оберег с изображением Уд, увеличивает мужскую силу. Ей покровительствует Купала;','Руна Уд В славянском рунном алфавите символизирует букву У Перевод и значение славянской руны: Уд символизирует сына Велеса, Яровита или же сына скандинавского бога Одина, Бальдра. Руна несет его можною силы, делающую женщин женственными, а всех мужчин мужественными –  Ярь. В скандинавском футарке Уд соответствует руна Уруз и немного по своим значениям и Ингуз. Это сила – объединяющая два противоположных начала и рождающая новую жизнь, это огонь любви и страсть, творческая вспышка и влечение. Неслучайно слово Уд воспринимается еще как и конечность, член, фаллос – символ плодородия и преображения Хаоса, превращение пустоты в Бытие.Ярило как руна Уд – это весна, это цветение, пробуждение живого и радость. Это страстные отношения между парой, зачатие, тепло, рост, секс, желание, красота и молодость.']

f=['110010000', '500', 'ферт', 'рун_нет']

x=['111110100', '600', 'хер', 'рок','Основные смыслы: Рок, Дух, судьба, непознанное, скрытое       Руна Рок – Сила Порядка, действий в рамках жесткой структуры мира, определяемой богами. Символизирует Рок – понятие редкое для мировоззрения славян. Это не римский Фатум, от которого не убежать, а скорее великие Законы Природы соответственно которым необходимо жить человеку;','Руна Рок В славянском рунном алфавите символизирует букву Х Перевод и значение славянской руны: Это карма, предопределение, судьба, неизбежность – это Рок, уготованный Богами. Это отсутствие вариантов, выхода, решимости, но также и важное событие, надежда на лучшую долю.Комментарии: сложная руна, руна предопределенности, руна кармы. Ее девиз «чему быть – того не миновать».На самом деле Рок – это не трансформировавшийся в плоть или визуальное обличье Дух, его можно только ощущать и понимать. Даже Боги не могут изменить уготованного Роком – ведь он нигде и везде, и это структура всех миров: Яви, Нави и Прави. Часто при раскладах или в магии выпадающий на долю человека Рок – это переход из одной формы в другую, вступление в Игру Высших Сил и абсолютно непредсказуемый, известный лишь отдельный ведунам исход.В скандинавском футарке есть близкие по смыслу руны Хагалаз, Эйваз и Перт, однако ни одна из них не отражает силу славянской руны Рок полностью. Также сходны по значению с Роком Эар, Квеорт и Гар – нортумбийские рунные символы.']

o2=['1001011000', '700', 'от(омега)', 'опора','Основные смыслы: Боги, Коло, Родина, кол, столб, опора       Руна Опора – шаманский транс, соединение сознания с другими частями «я», а затем и с самой вселенной. Прослеживается связь с родовым древом славян – дубом и с посохом Силы, служащим оберегом волхву, оружием воину и опорой калеке;','Руна Опора В славянском рунном алфавите символизирует букву О Перевод и значение славянской руны: Опора – это помощь и защита Богов, магический круг, зона воздействия, ключевая цель, твердость духа и стойкость личной позиции. В магии этой руной обозначают, как и Манназом, объект воздействия. Но при этом в футарке есть сходные по основному значению руны – Ансуз и Отал.Опора – это руна Богов, основание Мира. То есть именно столпами – опорами являются Боги и Мировое древо для всех людей. На нормандском бог и столб — «ass» / «ans» звучат практически одинаково. Ось Древа – это круглый столб, Кол, Коло. Окружность его – это замкнутый круг уважения и почитания Богов, следования своей судьбе. Опора – это жизнь с наследием Предков, Родина.']

ci=['1010111100', '900', 'цы', 'чернобог','Основные смыслы: Чернобог, перевернутое Мировое Древо, тень, шут      Руна Чернобог – воплощение Бога-трикстера, правителя «той стороны» всегда скрытого в тени, помогающего открыть в себе глубинные, потаенные силы;','Руна Чернобог В славянском рунном алфавите символизирует букву Ч или Ц Перевод и значение славянской руны: в противовес Белбогу Чернобог – абсолютное зло. Чтобы на Пути и в Жизни появилось место для чего-то нового, хорошего – нужно разрушить старое, ненужное. Хотите новой любви, приготовьтесь потерять прошлые воспоминания, и т.д. Чернобог и Белбог – это две стороны Бытия, две грани Равновесия. Руны Мир (Белбог) и Чернобог вместе производят Рок, руну Судьбы. Значение самой руны при переводе: изменение и разрушение, причинение вреда даже в благих целях (например – проведение операции), двойное дно, скрытое присутствие и негативное воздействие.Если Чернобог защищает от воздействия Хаоса и охраняет мировой Порядок, то Чернобог связывает нас с дорогами и силами Хаоса. Однако считать абсолютное зло только негативным действием или силой будет неправильным, так как Человек состоит из добра и зла, и взгляд на тот или иной поступок и его причины будет абсолютно разными в разных ситуациях.Именно поэтому существование и взаимодействие Добра и Зла неизменно в ПриРоде и постоянно стремится к Равновесию этих центробежных сил, влияющих на сам Мир.Руна Чернобога – это бог-трикстер, Шут и Паяц, сражающийся со стражем Порядка и нарушающий установленные Границы. По отношению к человеку руна – тень за нашим левым плечом, которая играючи ведет нас к срыванию личин и разрушению иллюзий. В магии Чернобог помогает разрешать старые ненужные связи и прорываться из замкнутого круга.В скандинавском футарке руна Чернобог находит большие совпадения в руне Хагалаз и отчасти – в Перте. Одним из образов Чернобога является вездесущий шутник и разрушитель Локи.']

ch=['1110000100', '1000', 'червь', 'чернобог','Основные смыслы: Чернобог, перевернутое Мировое Древо, тень, шут      Руна Чернобог – воплощение Бога-трикстера, правителя «той стороны» всегда скрытого в тени, помогающего открыть в себе глубинные, потаенные силы;','Руна Чернобог В славянском рунном алфавите символизирует букву Ч или Ц Перевод и значение славянской руны: в противовес Белбогу Чернобог – абсолютное зло. Чтобы на Пути и в Жизни появилось место для чего-то нового, хорошего – нужно разрушить старое, ненужное. Хотите новой любви, приготовьтесь потерять прошлые воспоминания, и т.д. Чернобог и Белбог – это две стороны Бытия, две грани Равновесия. Руны Мир (Белбог) и Чернобог вместе производят Рок, руну Судьбы. Значение самой руны при переводе: изменение и разрушение, причинение вреда даже в благих целях (например – проведение операции), двойное дно, скрытое присутствие и негативное воздействие.Если Чернобог защищает от воздействия Хаоса и охраняет мировой Порядок, то Чернобог связывает нас с дорогами и силами Хаоса. Однако считать абсолютное зло только негативным действием или силой будет неправильным, так как Человек состоит из добра и зла, и взгляд на тот или иной поступок и его причины будет абсолютно разными в разных ситуациях.Именно поэтому существование и взаимодействие Добра и Зла неизменно в ПриРоде и постоянно стремится к Равновесию этих центробежных сил, влияющих на сам Мир.Руна Чернобога – это бог-трикстер, Шут и Паяц, сражающийся со стражем Порядка и нарушающий установленные Границы. По отношению к человеку руна – тень за нашим левым плечом, которая играючи ведет нас к срыванию личин и разрушению иллюзий. В магии Чернобог помогает разрешать старые ненужные связи и прорываться из замкнутого круга.В скандинавском футарке руна Чернобог находит большие совпадения в руне Хагалаз и отчасти – в Перте. Одним из образов Чернобога является вездесущий шутник и разрушитель Локи.']

sh=['1111101000', '0', 'ша', 'рун_нет']

shi=['0', '800', 'шта', 'рун_нет']

er=['1100100000', '0', 'ер', 'рун_нет']

ere=['0', '0', 'еры', 'рун_нет']

eri=['0', '0', 'ерь', 'рун_нет']

ee=['0', '6', 'есть', 'рун_нет']

yu=['110', '0', 'ю', 'рун_нет']

yt=['0', '0', 'ять', 'рун_нет']



mir=[]
ds=[]
cs=[]
gl=[]
ru=[]
rs=[]
orun=[]







for slovo[0] in slovo:
      if(slovo==str):
                  print('slovo')
                  ds.append(slovo)
                  cs.append('ТОЛЬКО СИМВОЛЫ КИЛИЛИЦЫ')
                  gl.append('ТОЛЬКО СИМВОЛЫ КИЛИЛИЦЫ')
                  ru.append('ТОЛЬКО СИМВОЛЫ КИЛИЛИЦЫ')
                  rs.append('только кирилица')
                  orun.append('njkmrj rbhbkbwf')
      elif(slovo[0]=='а'):
                  ds.append(a[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(a[1])
                  gl.append(a[2]+'')
                  ru.append(a[3])
                  rs.append(a[4])
                  rs.append('........................................................................................................................................................................................')
                  orun.append(a[5])
                  orun.append('......................................................................................................................................................................................')
      elif(slovo[0]=='б'):
                  ds.append(b[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(b[1])
                  gl.append(b[2]+'')
                  ru.append(b[3])
                  rs.append(b[4])
                  rs.append('........................................................................................................................................................................................')
                  orun.append(b[5])
                  orun.append('......................................................................................................................................................................................')
      elif(slovo[0]=='в'):
                  ds.append(v[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(v[1])
                  gl.append(v[2]+'')
                  ru.append(v[3])
                  rs.append(v[4])
                  rs.append('........................................................................................................................................................................................')
                  orun.append(v[5])
                  orun.append('......................................................................................................................................................................................')
      elif(slovo[0]=='г'):
                  ds.append(g[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(g[1])
                  gl.append(g[2]+'')
                  ru.append(g[3])
                  rs.append(g[4])
                  rs.append('........................................................................................................................................................................................')
                  orun.append(k[5])
                  orun.append('......................................................................................................................................................................................')
      elif(slovo[0]=='д'):
                  set(ds)
                  mir.append(ds)
                  mir.append(ds)
                  cs.append(d[1])
                  gl.append(d[2]+'')
                  ru.append(d[3])
                  rs.append(d[4])
                  rs.append('........................................................................................................................................................................................')
                  orun.append(d[5])
                  orun.append('......................................................................................................................................................................................')
      elif(slovo[0]=='е'):
                  ds.append(e[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(e[1])
                  gl.append(e[2]+'')
                  ru.append(e[3])
                  rs.append(e[4])
                  rs.append('........................................................................................................................................................................................')
                  orun.append(e[5])
                  orun.append('......................................................................................................................................................................................')
      elif(slovo[0]=='ё'):
                  ds.append(e[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(e[1])
                  gl.append(e[2]+'')
                  ru.append(e[3])
      elif(slovo[0]=='ж'):
                  ds.append(ge[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(ge[1])
                  gl.append(ge[2]+'')
                  ru.append(ge[3])
      elif(slovo[0]=='з'):
                  ds.append(z1[0])
                  set(ds)
                  mir.append(ds)
                  ds.append(z2[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(z1[1])
                  cs.append(z2[1])
                  gl.append(z1[2])
                  gl.append('ЗАВИСИТ ОТ ПОТОДЕНИЯ')
                  gl.append(z2[2]+'')
                  ru.append(z1[3])
                  ru.append(z2[3])
      elif(slovo[0]=='и'):
                  ds.append(i1[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(i1[1])
                  gl.append(i1[2]+'')
                  ru.append(i1[3])
                  rs.append(i1[4])
                  rs.append('........................................................................................................................................................................................')
                  orun.append(i1[5])
                  orun.append('......................................................................................................................................................................................')
      elif(slovo[0]=='й'):
                  ds.append(i2[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(i2[1])
                  gl.append(i2[2]+'')
                  ru.append(i2[3])
                  rs.append(i2[4])
                  rs.append('........................................................................................................................................................................................')
                  orun.append(i2[5])
                  orun.append('......................................................................................................................................................................................')
      elif(slovo[0]=='к'):
                  ds.append(k[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(k[1])
                  gl.append(k[2]+'')
                  ru.append(k[3])
                  rs.append(k[4])
                  orun.append(k[5])
      elif(slovo[0]=='л'):
                  ds.append(l[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(l[1])
                  gl.append(l[2]+'')
                  ru.append(l[3])
                  rs.append(l[4])
                  rs.append('........................................................................................................................................................................................')
                  orun.append(l[5])
                  orun.append('......................................................................................................................................................................................')
      elif(slovo[0]=='м'):
                  ds.append(m[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(m[1])
                  gl.append(m[2]+'')
                  ru.append(m[3])
                  rs.append(m[4])
                  rs.append('........................................................................................................................................................................................')
                  orun.append(m[5])
                  orun.append('......................................................................................................................................................................................')
      elif(slovo[0]=='н'):
                  ds.append(n[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(n[1])
                  gl.append(n[2]+'')
                  ru.append(n[3])
                  rs.append(n[4])
                  rs.append('........................................................................................................................................................................................')
                  orun.append(n[5])
                  orun.append('......................................................................................................................................................................................')
      elif(slovo[0]=='о'):
                  ds.append(o1[0])
                  ds.append(o2[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(o1[1])
                  cs.append(o2[1])
                  gl.append(o1[2])
                  gl.append('_"зависит от положения"_')
                  gl.append(o2[2]+'')
                  ru.append(o1[3])
                  rs.append(o1[4])
                  rs.append('........................................................................................................................................................................................')
                  orun.append(o1[5])
                  orun.append('......................................................................................................................................................................................')
      elif(slovo[0]=='п'):
                  ds.append(p[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(p[1])
                  gl.append(p[2]+'')
                  ru.append(p[3])
                  rs.append(p[4])
                  rs.append('........................................................................................................................................................................................')
                  orun.append(p[5])
                  orun.append('......................................................................................................................................................................................')
      elif(slovo[0]=='р'):
                  ds.append(r[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(r[1])
                  gl.append(r[2]+'')
                  ru.append(r[3])
                  rs.append(r[4])
                  rs.append('........................................................................................................................................................................................')
                  orun.append(r[5])
                  orun.append('......................................................................................................................................................................................')
      elif(slovo[0]=='с'):
                  ds.append(s[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(s[1])
                  gl.append(s[2]+'')
                  ru.append(s[3])
                  rs.append(s[4])
                  rs.append('........................................................................................................................................................................................')
                  orun.append(s[5])
                  orun.append('......................................................................................................................................................................................')
      elif(slovo[0]=='т'):
                  ds.append(t[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(t[1])
                  gl.append(t[2]+'')
                  ru.append(t[3])
                  rs.append(t[4])
                  rs.append('........................................................................................................................................................................................')
                  orun.append(t[5])
                  orun.append('......................................................................................................................................................................................')
      elif(slovo[0]=='у'):
                  ds.append(y[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(y[1])
                  gl.append(y[2]+'')
                  ru.append(y[3])
                  rs.append(y[4])
                  rs.append('........................................................................................................................................................................................')
                  orun.append(y[5])
                  orun.append('......................................................................................................................................................................................')
      elif(slovo[0]=='ф'):
                  ds.append(f[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(f[1])
                  gl.append(f[2]+'')
                  ru.append(f[3])
      elif(slovo[0]=='х'):
                  ds.append(x[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(x[1])
                  gl.append(x[2]+'')
                  ru.append(x[3])
                  rs.append(x[4])
                  rs.append('........................................................................................................................................................................................')
                  orun.append(x[5])
                  orun.append('......................................................................................................................................................................................')
      elif(slovo[0]=='ц'):
                  ds.append(ci[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(ci[1])
                  gl.append(ci[2]+'')
                  ru.append(ci[3])
                  rs.append(ci[4])
                  rs.append('........................................................................................................................................................................................')
                  orun.append(ci[5])
                  orun.append('......................................................................................................................................................................................')
      elif(slovo[0]=='ч'):
                  ds.append(ch[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(ch[1])
                  gl.append(ch[2]+'')
                  ru.append(ch[3])
                  rs.append(ch[4])
                  rs.append('........................................................................................................................................................................................')
                  orun.append(ch[5])
                  orun.append('......................................................................................................................................................................................')
      elif(slovo[0]=='ш'):
                  ds.append(sh[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(sh[1])
                  gl.append(sh[2]+'')
                  ru.append(sh[3])
                  rs.append(sh[4])
      elif(slovo[0]=='щ'):
                  ds.append(shi[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(shi[1])
                  gl.append(shi[2])
                  ru.append(shi[3])
                  rs.append(shi[4])
                  orun.append(shi[5])
      elif(slovo[0]=='ъ'):
                  ds.append(er[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(er[1])
                  gl.append(er[2]+'')
                  ru.append(er[3])
      elif(slovo[0]=='ы'):
                  ds.append(ere[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(ere[1])
                  gl.append(ere[2]+'')
                  ru.append(ere[3])	
      elif(slovo[0]=='ь'):
                  ds.append(eri[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(eri[1])
                  gl.append(eri[2]+'')
                  ru.append(eri[3])
      elif(slovo[0]=='э'):
                  ds.append(ee[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(ee[1])
                  gl.append(ee[2]+'')
                  ru.append(ee[3])
                  rs.append(ee[4])
                  orun.append(ee[5])
      elif(slovo[0]=='ю'):
                  ds.append(yu[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(yu[1])
                  gl.append(yu[2]+'')
                  ru.append(yu[3])
      elif(slovo[0]=='я'):
                  ds.append(yt[0])
                  set(ds)
                  mir.append(ds)
                  cs.append(yt[1])
                  gl.append(yt[2])
                  ru.append(yt[3])
      else:
            (slovo[0]=='.')
          
print('\n Перевод завершен............ДВОИЧНАЯ СИСТЕМА..............\n\n')
print(ds)
mir.append(ds)
print('\n Перевод завершен............ЦИФРОВОЕ ЗНАЧЕНИЕ.............\n\n')
print(cs)



print('\n Перевод завершен............ГЛАГОЛИТЦА.....................\n\n')
        
          
print(gl)           
          
print('\n Перевод завершен..........СЛАВЯНСКИЕ РУНЫ..................\n\n')
print(ru)
print('\n\n\n.........................................................\n\n')



print('\n\n Перевод завершен............ОБРАЗ РУНЫ..............///////////////\n\n\n\n')

print(rs)
print('\n\n\n...........................описание рун................................\n\n')

print(orun)

del  slovo[:]
del  cs[:]
del  gl[:]
del  ru[:]
del  rs[:]
del  orun[:]
import _test_

_test_.my_func()
otz=input('продолжим?\nд/н\n:')
otz=list(otz)

set(otz)



for otz[0] in list(otz):
      if(otz[0]=='д'):
            _test_.my_func()
            del  otz[:]
else:
      myString =list(mir)
      print(myString)
      print('сохрани бинарный код')
      input('enter')
      exit()